var statement; // инструкция
statement = 5+2; // выражение
"hjjcs"; // литералы

var str = "lkjfsl";

// Операторы

//Арифметические
//3+2 //5
//2*2 //4
//5%2 //1 остаток от деления

//2+3*5

//=  //присваивает

//++i; инкремент, увеличивет на единицу
//--i; дикремент, уменьшает на единицу
var i = 2;
var b = 2;

//console.log (++i);
//console.log (b);
//console.log (b++);

var m = 10;
//console.log ( m+=2 );

//for (var a=1, b=2, c=3; b<3, b++) {

// }

//Сравнения

var a = 4,
	b = 5;
a < b;
a > b;
a <= b;
a >= b;

// знать надо, но не использовать
a == b; // оператор равенства
a != b; // оператор неравенства

// нужно использовать
a === b; // оператор строгого равенства
a !== b; // оператор строгого неравенства

//Условные
//Логические
//Побитовые